; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v6)
             (pred_9 ?v5 ?v3)
             (pred_4 ?v9 ?v3)
             (pred_1 ?v8 ?v9 )
	     (pred_3 ?v9)
             (pred_11 ?v7)
             (pred_8 ?v5)
             (pred_10 ?v3)
             (pred_12 ?v9)
             (pred_7 ?v5)
             (pred_2 ?v9)
             (pred_6 ))



(:action op_4
:parameters (?v2 ?v1 ?v10 ?v4)
:precondition (and (pred_11 ?v2) (pred_11 ?v1) (pred_8 ?v10) (pred_10 ?v4)
          (pred_5 ?v2 ?v1) (pred_9 ?v10 ?v4)
                   (pred_4 ?v1 ?v4) (pred_3 ?v2) 
                   (pred_12 ?v1) (pred_7 ?v10))
:effect (and  (pred_2 ?v1) (not (pred_12 ?v1))))


(:action op_3
:parameters (?v2 ?v12)
:precondition (and (pred_11 ?v2) (pred_11 ?v12)
               (pred_3 ?v2) (pred_5 ?v2 ?v12) (pred_2 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v2))))

(:action op_5
:parameters (?v2 ?v10)
:precondition (and (pred_11 ?v2) (pred_8 ?v10) 
                  (pred_3 ?v2) (pred_1 ?v10 ?v2) (pred_6 ))
:effect (and (pred_7 ?v10)
   (not (pred_1 ?v10 ?v2)) (not (pred_6 ))))


(:action op_1
:parameters (?v2 ?v11 ?v13)
:precondition (and (pred_11 ?v2) (pred_8 ?v11) (pred_8 ?v13)
                  (pred_3 ?v2) (pred_7 ?v13) (pred_1 ?v11 ?v2))
:effect (and (pred_7 ?v11) (pred_1 ?v13 ?v2)
        (not (pred_7 ?v13)) (not (pred_1 ?v11 ?v2))))

(:action op_2
:parameters (?v2 ?v10)
:precondition (and (pred_11 ?v2) (pred_8 ?v10) 
                  (pred_3 ?v2) (pred_7 ?v10))
:effect (and (pred_6 ) (pred_1 ?v10 ?v2) (not (pred_7 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_09 obj_19 obj_13 obj_16 obj_17 obj_05 obj_07 obj_10 obj_03 obj_04 obj_11 obj_15 obj_12 obj_14 obj_06
    obj_08 obj_01
    obj_18 obj_02
    )

    (:init
       (pred_6)

       (pred_11 obj_20)
       (pred_11 obj_09)
       (pred_11 obj_19)
       (pred_11 obj_13)
       (pred_11 obj_16)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_04)
       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_12)
       (pred_11 obj_14)
       (pred_11 obj_06)
       (pred_10 obj_08)
       (pred_10 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_02)

       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_09 obj_17)
       (pred_5 obj_09 obj_19)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_07 obj_13)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_10 obj_03)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_03 obj_12)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_10)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_07)
       (pred_5 obj_11 obj_04)
       (pred_5 obj_15 obj_12)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_12 obj_14)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_12 obj_15)
       (pred_5 obj_14 obj_06)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_14 obj_12)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_14)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_4  obj_04 obj_08)
       (pred_4  obj_09 obj_01)
       (pred_2 obj_20)
       (pred_2 obj_19)
       (pred_2 obj_13)
       (pred_2 obj_16)
       (pred_2 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_07)
       (pred_2 obj_10)
       (pred_2 obj_03)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_2 obj_12)
       (pred_2 obj_14)
       (pred_2 obj_06)

       (pred_9  obj_18 obj_08)
       (pred_9  obj_02 obj_01)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_02 obj_13)
       (pred_3 obj_03)
    )

    (:goal (and
       (pred_1 obj_02 obj_20)
    ))
(:constraints
  (always (not (pred_3 obj_19)))
)
)

; plan
1. (op_3 obj_03 obj_17)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_17)
   goals met: 0 of 1
2. (op_3 obj_17 obj_05)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_05)
   goals met: 0 of 1
3. (op_3 obj_05 obj_07)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_07)
   goals met: 0 of 1
4. (op_3 obj_07 obj_13)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_13)
   goals met: 0 of 1
5. (op_5 obj_13 obj_02)
   deleted: (pred_1 obj_02 obj_13) (pred_6)
   added: (pred_7 obj_02)
   goals met: 0 of 1
6. (op_3 obj_13 obj_07)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_07)
   goals met: 0 of 1
7. (op_3 obj_07 obj_05)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_05)
   goals met: 0 of 1
8. (op_3 obj_05 obj_17)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_17)
   goals met: 0 of 1
9. (op_3 obj_17 obj_16)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_16)
   goals met: 0 of 1
10. (op_3 obj_16 obj_20)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_20)
   goals met: 0 of 1
11. (op_2 obj_20 obj_02)
   deleted: (pred_7 obj_02)
   added: (pred_6) (pred_1 obj_02 obj_20)
   goals met: 1 of 1
